TaurusTests/test4.yml
---
execution:
- concurrency: 10
  ramp-up: 10s
  hold-for: 60s
  iterations: 10
  scenario: basic-services-test


scenarios:
  basic-services-test:
    requests:
    - http://192.168.99.100:5000/news
    - http://192.168.99.100:5000/status
    - http://192.168.99.100:5050/comments
    - http://192.168.99.100:5050/status
    - url: http://192.168.99.100:5050/comments/add
      method: POST
      headers:
          Content-Type: application/json
      body-file: json_add_comment.json
    - url: http://192.168.99.100:5050/comments/deleteRandom
      method: DELETE
      
reporting:
- final-stats
- console
- blazemeter