TaurusTests/test6.yml
---
execution:
- concurrency: 15
  ramp-up: 15s
  hold-for: 180s
  iterations: 100
  scenario: basic-services-test


scenarios:
  basic-services-test:
    requests:
    - http://192.168.99.100:5000/news
    - http://192.168.99.100:5000/status
    - url: http://192.168.99.100:5000/news/add
      method: POST
      headers:
          Content-Type: application/json
      body-file: json_add_news.json
    - url: http://192.168.99.100:5000/news/deleteRandom
      method: DELETE
    - http://192.168.99.100:5050/comments
    - http://192.168.99.100:5050/status
    - url: http://192.168.99.100:5050/comments/add
      method: POST
      headers:
          Content-Type: application/json
      body-file: json_add_comment.json
    - url: http://192.168.99.100:5050/comments/deleteRandom
      method: DELETE

reporting:
- final-stats
- console
- blazemeter