TaurusTests/test7.yml
---
execution:
- concurrency: 10
  ramp-up: 8s
  hold-for: 60s
  iterations: 1000
  scenario: basic-services-endurance-test


scenarios:
  basic-services-endurance-test:
    requests:
    - http://192.168.99.100:5000/status
    - url: http://192.168.99.100:5000/news/add
      method: POST
      headers:
          Content-Type: application/json
      body-file: json_add_news.json
    - url: http://192.168.99.100:5000/news/deleteRandom
      method: DELETE
    - http://192.168.99.100:5050/status
    - url: http://192.168.99.100:5050/comments/add
      method: POST
      headers:
          Content-Type: application/json
      body-file: json_add_comment.json
    - url: http://192.168.99.100:5050/comments/deleteRandom
      method: DELETE

reporting:
- final-stats
- console
- blazemeter