TaurusTests/test_extra.yml
---
execution:
- concurrency: 10
  ramp-up: 10s
  hold-for: 60s
  scenario: basic-services-test


scenarios:
  basic-services-test:
    requests:
    - url: http://localhost:5000/news/add
      method: POST
      headers:
          Content-Type: application/json
      body-file: json_add_news.json
    - url: http://localhost:5000/news/deleteRandom
      method: DELETE